#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github.github_repository.emploidutemps has changed
  ~ resource "github_repository" "emploidutemps" {
      ~ etag                   = "W/\"95a0a879b58a96efac4a52997ec8fd989e889968238bc078cc4196a384718cea\"" -> "W/\"b8acaeb54c468785b2815660309fd6ec9de08632a1035a98acc87649b3d5d504\""
        id                     = "emploidutemps"
        name                   = "emploidutemps"
        # (25 unchanged attributes hidden)
    }

  # module.github.github_repository.payutc_mobile has changed
  ~ resource "github_repository" "payutc_mobile" {
      ~ etag                   = "W/\"383947b42f8ec3ecb7be5626f5693e6c4f396cd0e1df0b89807ceb6c9f18969f\"" -> "W/\"22883627386afaa64ea7fd72fda0e5c686abec94e9543e1b89794997d335bada\""
        id                     = "payutc-mobile"
        name                   = "payutc-mobile"
        # (25 unchanged attributes hidden)
    }

  # module.github.github_team_repository.payutc_payutc_mobile has changed
  ~ resource "github_team_repository" "payutc_payutc_mobile" {
      ~ etag       = "W/\"51260020b3581faed0c6edafdbeab76a4cd4dd8ef0dd3924f56b29ae4f28fcf4\"" -> "W/\"09c603afb397b085817039e73b829e1975582e24b28c1fce070e6789bc7ceeff\""
        id         = "3158200:payutc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.simde_terraform has changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"e54d6fc73c63c03eeded9492d05f9b379d6b795763f8da9ed39979119b447fa2\"" -> "W/\"e9727bb8381bf43139b7ed6170b10094cef1d81f0ad41e0395f5097aa76b2db9\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_branch_protection.flairsou-api_master has changed
  ~ resource "github_branch_protection" "flairsou-api_master" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAyNjA4NzY="
        # (7 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ required_approving_review_count = 1 -> 2
            # (4 unchanged attributes hidden)
        }
    }

  # module.github.module.repositories.github_team_repository.flairsou_flairsou-api has changed
  ~ resource "github_team_repository" "flairsou_flairsou-api" {
      ~ etag       = "W/\"677c4a0399b44c8a8d397f606ad16702ac70417aeeea24d0b7884381730bc2f7\"" -> "W/\"60875a3a40dfc35e231f0abe6e88cda6edd14307668588a0c607bce4dbae4197\""
        id         = "4276153:flairsou-api"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkultra has changed
  ~ resource "github_team_repository" "gesasso_gesasso_mkultra" {
      ~ etag       = "W/\"73727accceaa7d1ce57ac121623f1e1d1cca190b3ef55039d746957056381554\"" -> "W/\"a39d2b5a8cf88cbad45b9d9b516a167d00e9ec6adb6815bfb47ef72ac6bb9cbe\""
        id         = "4673796:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_flairsou-api has changed
  ~ resource "github_team_repository" "simde_flairsou-api" {
      ~ etag       = "W/\"677c4a0399b44c8a8d397f606ad16702ac70417aeeea24d0b7884381730bc2f7\"" -> "W/\"60875a3a40dfc35e231f0abe6e88cda6edd14307668588a0c607bce4dbae4197\""
        id         = "4217733:flairsou-api"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkultra has changed
  ~ resource "github_team_repository" "simde_gesasso_mkultra" {
      ~ etag       = "W/\"73727accceaa7d1ce57ac121623f1e1d1cca190b3ef55039d746957056381554\"" -> "W/\"a39d2b5a8cf88cbad45b9d9b516a167d00e9ec6adb6815bfb47ef72ac6bb9cbe\""
        id         = "4217733:gesasso_mkultra"
        # (3 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_team_repository.simde_oauth_pda_utc has changed
  ~ resource "github_team_repository" "simde_oauth_pda_utc" {
      ~ etag       = "W/\"d6a5ddad852bd5bd0508e368dd99a3af691e12c4037c6b42c4beb2539dae2696\"" -> "W/\"0f99a02bbe6b6060e7397be52d35048d9ac8a5acf66270d052092e0f6c63ec26\""
        id         = "4217733:oauth_pda_utc"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.comet_spam will be created
  + resource "discord_channel_permission" "comet_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "895025366974992434"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.curieux_spam will be created
  + resource "discord_channel_permission" "curieux_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "811956831219613768"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.everyone_games will be updated in-place
  ~ resource "discord_channel_permission" "everyone_games" {
      ~ allow        = 100764736 -> 103924288
        id           = "1359208525"
        # (4 unchanged attributes hidden)
    }

  # module.discord_simde.discord_channel_permission.everyone_questions_techniques will be created
  + resource "discord_channel_permission" "everyone_questions_techniques" {
      + allow        = 103924288
      + channel_id   = "816982748500983829"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778767831957535"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.gesasso_spam will be created
  + resource "discord_channel_permission" "gesasso_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "892342940226158603"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.integfev_spam will be created
  + resource "discord_channel_permission" "integfev_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "897464433801060463"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.jeffery_notifications will be destroyed
  # (because discord_channel_permission.jeffery_notifications is not in configuration)
  - resource "discord_channel_permission" "jeffery_notifications" {
      - allow        = 100762688 -> null
      - channel_id   = "778636669737369651" -> null
      - deny         = 199937 -> null
      - id           = "4429080" -> null
      - overwrite_id = "782684806961561660" -> null
      - type         = "role" -> null
    }

  # module.discord_simde.discord_channel_permission.jeffrey_notifications will be created
  + resource "discord_channel_permission" "jeffrey_notifications" {
      + allow        = 100762688
      + channel_id   = "778636669737369651"
      + deny         = 199937
      + id           = (known after apply)
      + overwrite_id = "782684806961561660"
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.member_notifications must be replaced
-/+ resource "discord_channel_permission" "member_notifications" {
      ~ id           = "2712721542" -> (known after apply)
      ~ overwrite_id = "781934406292996116" -> "759778776560828447" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.discord_simde.discord_channel_permission.member_spam will be created
  + resource "discord_channel_permission" "member_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 16 -> 17
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.bde will be updated in-place
  ~ resource "discord_role" "bde" {
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.comet will be updated in-place
  ~ resource "discord_role" "comet" {
        id          = "895025366974992434"
        name        = "COMET"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.emploidut will be updated in-place
  ~ resource "discord_role" "emploidut" {
        id          = "814062042973339679"
        name        = "Emploi du temps"
      ~ position    = 6 -> 7
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.etuville will be updated in-place
  ~ resource "discord_role" "etuville" {
        id          = "886977202707648563"
        name        = "Etuville"
      ~ position    = 11 -> 12
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.gesasso will be updated in-place
  ~ resource "discord_role" "gesasso" {
        id          = "892342940226158603"
        name        = "Projet Gesasso"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integ will be updated in-place
  ~ resource "discord_role" "integ" {
        id          = "802911395758473247"
        name        = "Integ"
      ~ position    = 12 -> 13
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integfev will be updated in-place
  ~ resource "discord_role" "integfev" {
        id          = "897464433801060463"
        name        = "Integ Fev"
      ~ position    = 4 -> 5
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.jeffrey will be updated in-place
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 10 -> 11
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 14 -> 15
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.sparkle will be created
  + resource "discord_role" "sparkle" {
      + color       = 14737408
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = true
      + name        = "Projet Sparkle"
      + permissions = 103924288
      + position    = 4
      + server_id   = "759778767831957535"
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 13 -> 14
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.woolly will be updated in-place
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 9 -> 10
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 15 -> 16
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.questions-techniques will be updated in-place
  ~ resource "discord_text_channel" "questions-techniques" {
        id                       = "816982748500983829"
        name                     = "questions-techniques"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.spam will be updated in-place
  ~ resource "discord_text_channel" "spam" {
        id                       = "816982749675913226"
        name                     = "spam"
      ~ sync_perms_with_category = true -> false
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.BWRCat.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "273139242614652938"

      + role {
          + has_role = false
          + role_id  = "781934406292996116"
        }
    }

  # module.discord_simde.module.BWRCat.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1961962676" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "273139242614652938" -> null

      - role {
          - has_role = false -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.ThreeNias.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "720725739858559137"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.ThreeNias.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1699415724" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "720725739858559137" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.alexandre_brasseur.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "757649562813857965"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "784568395907465216"
        }
    }

  # module.discord_simde.module.alexandre_brasseur.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1095342113" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "757649562813857965" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.alexandre_brasseur.discord_member_roles.member_role["784568395907465216"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1095342113" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "757649562813857965" -> null

      - role {
          - has_role = true -> null
          - role_id  = "784568395907465216" -> null
        }
    }

  # module.discord_simde.module.antoine_cet.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "621730232365482004"

      + role {
          + has_role = false
          + role_id  = "781934406292996116"
        }
    }

  # module.discord_simde.module.antoine_cet.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "4264886267" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "621730232365482004" -> null

      - role {
          - has_role = false -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.anton42.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "301703000508989440"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "782684806961561660"
        }
    }

  # module.discord_simde.module.anton42.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2772452286" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "621730232365482004" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.anton42.discord_member_roles.member_role["782684806961561660"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2772452286" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "621730232365482004" -> null

      - role {
          - has_role = true -> null
          - role_id  = "782684806961561660" -> null
        }
    }

  # module.discord_simde.module.armand_ribault.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "418537351858487297"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "784568395907465216"
        }
    }

  # module.discord_simde.module.armand_ribault.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "693075349" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "418537351858487297" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.armand_ribault.discord_member_roles.member_role["784568395907465216"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "693075349" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "418537351858487297" -> null

      - role {
          - has_role = true -> null
          - role_id  = "784568395907465216" -> null
        }
    }

  # module.discord_simde.module.arthur_wacquez.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "223159129072599050"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
      + role {
          + has_role = true
          + role_id  = "814062042973339679"
        }
    }

  # module.discord_simde.module.arthur_wacquez.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "180756840" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "223159129072599050" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.arthur_wacquez.discord_member_roles.member_role["814062042973339679"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "180756840" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "223159129072599050" -> null

      - role {
          - has_role = true -> null
          - role_id  = "814062042973339679" -> null
        }
    }

  # module.discord_simde.module.cesar_richard.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "463652129878573056"

      + role {
          + has_role = false
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "759778778212991066"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
    }

  # module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "758910205" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "463652129878573056" -> null

      - role {
          - has_role = false -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.cesar_richard.discord_member_roles.member_role["759778778212991066"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "758910205" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "463652129878573056" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778778212991066" -> null
        }
    }

  # module.discord_simde.module.cesar_richard.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "758910205" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "463652129878573056" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.gabriel_francez.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "358722945813708800"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.gabriel_francez.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2607217684" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "358722945813708800" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.guillaume_theunissen.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "321975642684129293"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "892342940226158603"
        }
    }

  # module.discord_simde.module.guillaume_theunissen.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2704751811" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "321975642684129293" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.guillaume_theunissen.discord_member_roles.member_role["892342940226158603"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2704751811" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "321975642684129293" -> null

      - role {
          - has_role = true -> null
          - role_id  = "892342940226158603" -> null
        }
    }

  # module.discord_simde.module.jules_boulet.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "273849879489544193"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
    }

  # module.discord_simde.module.jules_boulet.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1101320857" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "273849879489544193" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.jules_boulet.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1101320857" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "273849879489544193" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.leopold_chappuis.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "359038397265870848"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "892342940226158603"
        }
    }

  # module.discord_simde.module.leopold_chappuis.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1011297589" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "359038397265870848" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.leopold_chappuis.discord_member_roles.member_role["892342940226158603"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1011297589" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "359038397265870848" -> null

      - role {
          - has_role = true -> null
          - role_id  = "892342940226158603" -> null
        }
    }

  # module.discord_simde.module.loic_jumel.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "352103192533794826"

      + role {
          + has_role = true
          + role_id  = "759778778212991066"
        }
    }

  # module.discord_simde.module.loic_jumel.discord_member_roles.member_role["759778778212991066"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1902794038" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "352103192533794826" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778778212991066" -> null
        }
    }

  # module.discord_simde.module.mael_belval.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "218687552004161536"

      + role {
          + has_role = true
          + role_id  = "777569554539741255"
        }
      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.mael_belval.discord_member_roles.member_role["777569554539741255"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "198571768" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "218687552004161536" -> null

      - role {
          - has_role = true -> null
          - role_id  = "777569554539741255" -> null
        }
    }

  # module.discord_simde.module.mael_belval.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "198571768" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "218687552004161536" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.mathias_deroubaix.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "750764518770212975"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
    }

  # module.discord_simde.module.mathias_deroubaix.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "3488612923" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "750764518770212975" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "772064855636836402"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "777569554539741255"
        }
    }

  # module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2713721276" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "772064855636836402" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.matthieu_decaux.discord_member_roles.member_role["777569554539741255"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2713721276" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "772064855636836402" -> null

      - role {
          - has_role = true -> null
          - role_id  = "777569554539741255" -> null
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "611205176493342752"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
      + role {
          + has_role = true
          + role_id  = "782684806961561660"
        }
      + role {
          + has_role = true
          + role_id  = "802911395758473247"
        }
      + role {
          + has_role = true
          + role_id  = "811739466012164167"
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2801032487" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "611205176493342752" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2801032487" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "611205176493342752" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["782684806961561660"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2801032487" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "611205176493342752" -> null

      - role {
          - has_role = true -> null
          - role_id  = "782684806961561660" -> null
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["802911395758473247"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2801032487" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "611205176493342752" -> null

      - role {
          - has_role = true -> null
          - role_id  = "802911395758473247" -> null
        }
    }

  # module.discord_simde.module.maxime_vaillant.discord_member_roles.member_role["811739466012164167"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2801032487" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "611205176493342752" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811739466012164167" -> null
        }
    }

  # module.discord_simde.module.nasser_chaouchi.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "243412317214212126"

      + role {
          + has_role = false
          + role_id  = "802911395758473247"
        }
    }

  # module.discord_simde.module.nasser_chaouchi.discord_member_roles.member_role["802911395758473247"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "3722273272" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "243412317214212126" -> null

      - role {
          - has_role = false -> null
          - role_id  = "802911395758473247" -> null
        }
    }

  # module.discord_simde.module.neil.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "407211719400882176"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.neil.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1818553744" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "407211719400882176" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.noe_amiot.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "301424363624857600"

      + role {
          + has_role = true
          + role_id  = "759778778212991066"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
    }

  # module.discord_simde.module.noe_amiot.discord_member_roles.member_role["759778778212991066"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1422878723" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "301424363624857600" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778778212991066" -> null
        }
    }

  # module.discord_simde.module.noe_amiot.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1422878723" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "301424363624857600" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.paco_pompeani.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "692765795788521532"

      + role {
          + has_role = true
          + role_id  = "781934406292996116"
        }
      + role {
          + has_role = true
          + role_id  = "886977202707648563"
        }
    }

  # module.discord_simde.module.paco_pompeani.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "491242633" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "692765795788521532" -> null

      - role {
          - has_role = true -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.paco_pompeani.discord_member_roles.member_role["886977202707648563"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "491242633" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "692765795788521532" -> null

      - role {
          - has_role = true -> null
          - role_id  = "886977202707648563" -> null
        }
    }

  # module.discord_simde.module.pascal_quach.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "239495459389964289"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
    }

  # module.discord_simde.module.pascal_quach.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1629963178" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "239495459389964289" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.pierre_adorni.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "322379809776861185"

      + role {
          + has_role = true
          + role_id  = "777569554539741255"
        }
      + role {
          + has_role = true
          + role_id  = "781934406292996116"
        }
      + role {
          + has_role = true
          + role_id  = "802911395758473247"
        }
    }

  # module.discord_simde.module.pierre_adorni.discord_member_roles.member_role["777569554539741255"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1753478587" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "322379809776861185" -> null

      - role {
          - has_role = true -> null
          - role_id  = "777569554539741255" -> null
        }
    }

  # module.discord_simde.module.pierre_adorni.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1753478587" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "322379809776861185" -> null

      - role {
          - has_role = false -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.pierre_adorni.discord_member_roles.member_role["802911395758473247"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1753478587" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "322379809776861185" -> null

      - role {
          - has_role = false -> null
          - role_id  = "802911395758473247" -> null
        }
    }

  # module.discord_simde.module.pierre_pouliquen.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "580741126294863903"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
    }

  # module.discord_simde.module.pierre_pouliquen.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "109119574" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "580741126294863903" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.private-admin.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331766016049173"
        name      = "private-admin"
      ~ position  = 12 -> 13
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-bde.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "811739465898000384"
        name      = "private-bde"
      ~ position  = 9 -> 10
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-emploidut.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "814062715789508648"
        name      = "private-emploidut"
      ~ position  = 10 -> 11
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-gesasso.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "892367298197876737"
        name      = "private-gesasso"
      ~ position  = 8 -> 9
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "897464433268391946"
        name      = "private-integfev"
      ~ position  = 11 -> 12
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-sparkle.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "private-sparkle"
      + position  = 8
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.private-sparkle.discord_channel_permission.admin[0] will be created
  + resource "discord_channel_permission" "admin" {
      + allow        = 100696136
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778778212991066"
      + type         = "role"
    }

  # module.discord_simde.module.private-sparkle.discord_channel_permission.member_denied[0] will be created
  + resource "discord_channel_permission" "member_denied" {
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.module.private-sparkle.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-sparkle"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.private-sparkle.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-sparkle"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

  # module.discord_simde.module.rayan_doudech.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "760802280621473793"

      + role {
          + has_role = true
          + role_id  = "781934406292996116"
        }
      + role {
          + has_role = true
          + role_id  = "897464433801060463"
        }
    }

  # module.discord_simde.module.rayan_doudech.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "3924843597" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "760802280621473793" -> null

      - role {
          - has_role = true -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.rayan_doudech.discord_member_roles.member_role["897464433801060463"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "3924843597" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "760802280621473793" -> null

      - role {
          - has_role = true -> null
          - role_id  = "897464433801060463" -> null
        }
    }

  # module.discord_simde.module.remy_huet.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "327723660259360768"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "777569554539741255"
        }
    }

  # module.discord_simde.module.remy_huet.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "334888942" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "327723660259360768" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.remy_huet.discord_member_roles.member_role["777569554539741255"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "334888942" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "327723660259360768" -> null

      - role {
          - has_role = true -> null
          - role_id  = "777569554539741255" -> null
        }
    }

  # module.discord_simde.module.romain_leclere.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "326477351665926145"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.romain_leclere.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "734068414" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "326477351665926145" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.romain_maliachauguste.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "753881213810507777"

      + role {
          + has_role = (known after apply)
          + role_id  = (known after apply)
        }
    }

  # module.discord_simde.module.romain_maliachauguste.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "42066677" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "753881213810507777" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.romain_maliachauguste.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "42066677" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "753881213810507777" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.romain_maliachauguste.discord_member_roles.member_role["886977202707648563"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "42066677" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "753881213810507777" -> null

      - role {
          - has_role = true -> null
          - role_id  = "886977202707648563" -> null
        }
    }

  # module.discord_simde.module.theo_chazeaud.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "776179622734856263"

      + role {
          + has_role = true
          + role_id  = "759778776560828447"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
    }

  # module.discord_simde.module.theo_chazeaud.discord_member_roles.member_role["759778776560828447"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "512477527" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "776179622734856263" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778776560828447" -> null
        }
    }

  # module.discord_simde.module.theo_chazeaud.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "512477527" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "776179622734856263" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.thibaud_duhautbout.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "428253404645556226"

      + role {
          + has_role = true
          + role_id  = "777569554539741255"
        }
    }

  # module.discord_simde.module.thibaud_duhautbout.discord_member_roles.member_role["777569554539741255"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1081451842" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "428253404645556226" -> null

      - role {
          - has_role = true -> null
          - role_id  = "777569554539741255" -> null
        }
    }

  # module.discord_simde.module.thomas_delplanque.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "324634860406964225"

      + role {
          + has_role = true
          + role_id  = "802911395758473247"
        }
    }

  # module.discord_simde.module.thomas_delplanque.discord_member_roles.member_role["802911395758473247"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1976986784" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "324634860406964225" -> null

      - role {
          - has_role = true -> null
          - role_id  = "802911395758473247" -> null
        }
    }

  # module.discord_simde.module.thomas_guegan.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "177800818576064512"

      + role {
          + has_role = false
          + role_id  = "781934406292996116"
        }
      + role {
          + has_role = false
          + role_id  = "802911395758473247"
        }
      + role {
          + has_role = false
          + role_id  = "895025366974992434"
        }
    }

  # module.discord_simde.module.thomas_guegan.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1284817253" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "177800818576064512" -> null

      - role {
          - has_role = false -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.thomas_guegan.discord_member_roles.member_role["802911395758473247"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1284817253" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "177800818576064512" -> null

      - role {
          - has_role = false -> null
          - role_id  = "802911395758473247" -> null
        }
    }

  # module.discord_simde.module.thomas_guegan.discord_member_roles.member_role["895025366974992434"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "1284817253" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "177800818576064512" -> null

      - role {
          - has_role = false -> null
          - role_id  = "895025366974992434" -> null
        }
    }

  # module.discord_simde.module.victor_moreliere.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "205355406011138048"

      + role {
          + has_role = false
          + role_id  = "781934406292996116"
        }
      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
    }

  # module.discord_simde.module.victor_moreliere.discord_member_roles.member_role["781934406292996116"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "122278598" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "205355406011138048" -> null

      - role {
          - has_role = true -> null
          - role_id  = "781934406292996116" -> null
        }
    }

  # module.discord_simde.module.victor_moreliere.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "122278598" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "205355406011138048" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "166621029412765696"

      + role {
          + has_role = true
          + role_id  = "759778778212991066"
        }
      + role {
          + has_role = true
          + role_id  = "776093666267758604"
        }
    }

  # module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["759778778212991066"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2314042217" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "166621029412765696" -> null

      - role {
          - has_role = true -> null
          - role_id  = "759778778212991066" -> null
        }
    }

  # module.discord_simde.module.victor_ronfaut.discord_member_roles.member_role["776093666267758604"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2314042217" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "166621029412765696" -> null

      - role {
          - has_role = true -> null
          - role_id  = "776093666267758604" -> null
        }
    }

  # module.discord_simde.module.victor_tondolo.discord_member_roles.member_role will be created
  + resource "discord_member_roles" "member_role" {
      + id        = (known after apply)
      + server_id = "759778767831957535"
      + user_id   = "699012818426527825"

      + role {
          + has_role = true
          + role_id  = "811956831219613768"
        }
      + role {
          + has_role = true
          + role_id  = "814062042973339679"
        }
    }

  # module.discord_simde.module.victor_tondolo.discord_member_roles.member_role["811956831219613768"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2872347151" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "699012818426527825" -> null

      - role {
          - has_role = true -> null
          - role_id  = "811956831219613768" -> null
        }
    }

  # module.discord_simde.module.victor_tondolo.discord_member_roles.member_role["814062042973339679"] will be destroyed
  # (because resource does not use for_each)
  - resource "discord_member_roles" "member_role" {
      - id        = "2872347151" -> null
      - server_id = "759778767831957535" -> null
      - user_id   = "699012818426527825" -> null

      - role {
          - has_role = true -> null
          - role_id  = "814062042973339679" -> null
        }
    }

  # module.github.module.repositories.github_branch_protection.flairsou-api_master will be updated in-place
  ~ resource "github_branch_protection" "flairsou-api_master" {
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjAyNjA4NzY="
        # (7 unchanged attributes hidden)

      ~ required_pull_request_reviews {
          ~ required_approving_review_count = 2 -> 1
            # (4 unchanged attributes hidden)
        }
    }

Plan: 49 to add, 22 to change, 66 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*